# Python env   : MicroPython v1.23.0
# -*- coding: utf-8 -*-
# @Time    : 2026/09/22
# @Author  : OldhamMade
# @File    : lm75_async.py
# @Description : LM75 asynchronous facade
# @License : MIT

# ======================================== 导入相关模块 =========================================
from lm75 import LM75

# ======================================== 全局变量 ============================================
# ======================================== 功能函数 ============================================
# ======================================== 自定义类 ============================================
class LM75Async(LM75):
    async def get_output_async(self):
        return self.get_output()

    async def get_temp_async(self):
        return self.get_temp()

    async def aclose(self):
        self.deinit()

# ======================================== 初始化配置 ===========================================
# ======================================== 主程序 ===============================================