# Python env   : MicroPython v1.23.0
# -*- coding: utf-8 -*-
# @Time    : 2025/9/5 下午10:11
# @Author  : ben0i0d
# @File    : main.py
# @Description : cc253x_ttl测试文件

# ======================================== 导入相关模块 =========================================

# 导入硬件相关模块
import time
from machine import UART,Pin
# 导入第三方驱动模块
from cc253x_ttl import CC253xTTL

# ======================================== 全局变量 ============================================

# ======================================== 功能函数 ============================================

# ======================================== 自定义类 =============================================

# ======================================== 初始化配置 ===========================================

# 上电延时3s
time.sleep(3)
# 打印调试信息
print("FreakStudio： cc253x_ttl test")

# 声明串口实例
uart0 = UART(0, baudrate=9600, tx=Pin(16), rx=Pin(17))
uart1 = UART(1, baudrate=9600, tx=Pin(8), rx=Pin(9))

# 协调器
cor = CC253xTTL(uart0)
# 路由器
env = CC253xTTL(uart1)

# ========================================  主程序  ===========================================

while True:
    # 路由器发送
    env.send_transparent("Here is EndDrive")
    time.sleep(0.5)
    # 协调器接收并且输出
    print(cor._uart.read())
    time.sleep(1)