# Python env   : MicroPython v1.23.0
# -*- coding: utf-8 -*-
# @Time    : 2025/9/5 下午10:11
# @Author  : ben0i0d
# @File    : main.py
# @Description : cc253x_ttl测试文件

# ======================================== 导入相关模块 =========================================

import time
import binascii
from machine import UART,Pin
from cc253x_ttl import CC253xTTL

# ======================================== 全局变量 ============================================

# ======================================== 功能函数 ============================================

# ======================================== 自定义类 =============================================

# ======================================== 初始化配置 ===========================================

# 上电延时3s
#time.sleep(3)
print("FreakStudio:cc253x_ttl test")

uart0 = UART(0, baudrate=9600, tx=Pin(0), rx=Pin(1))
#uart1 = UART(1, baudrate=9600, tx=Pin(4), rx=Pin(5))

cor = CC253xTTL(uart0,0x00)
#end = CC253xTTL(uart1,0x02)
print(cor.read_mac())

# ========================================  主程序  ===========================================
#while True:
    #if cor._uart.any():
