# Python env   : MicroPython v1.23.0
# -*- coding: utf-8 -*-
# @Time    : 2026/09/16 10:40
# @Author  : hogeiha
# @File    : mse_soil_sensor.py
# @Description : Compatibility export for MSE async driver
# @License : MIT
# ======================================== 导入相关模块 =========================================
from mse_soil_sensor_async import MSESoilSensorAsync
# ======================================== 全局变量 ============================================
__version__ = "0.1.0"
__author__ = "hogeiha"
__license__ = "MIT"
__platform__ = "MicroPython v1.23"
# ======================================== 功能函数 ============================================
# ======================================== 自定义类 ============================================
MSESoilSensor = MSESoilSensorAsync
# ======================================== 初始化配置 ==========================================
# ========================================  主程序  ===========================================
