# Python env   : MicroPython v1.23.0
# -*- coding: utf-8 -*-
# @Time    : 2025/9/5 下午10:11
# @Author  : ben0i0d
# @File    : main.py
# @Description : hc14_lora测试文件

# ======================================== 导入相关模块 =========================================

import time
from machine import Pin
from hc14_lora import HC14_Lora

# ======================================== 全局变量 ============================================

# ======================================== 功能函数 ============================================

# ======================================== 自定义类 =============================================

# ======================================== 初始化配置 ===========================================

# 上电延时3s
time.sleep(3)
print("FreakStudio:Infrared transceiver test")

a = HC14_Lora()


# ========================================  主程序  ===========================================
while True:
    print("[TX] Sending NEC signal...")
    # 地址=0x10, 命令=0x20
    ir_tx.transmit(0x10, 0x20)
    time.sleep(2)