# Python env   : MicroPython v1.23.0
# -*- coding: utf-8 -*-
# @Time    : 2025/09/08 10:00
# @Author  : 侯钧瀚
# @File    : main.py
# @Description : 基于PCF8574芯片的八段光条数码管模块

# ======================================== 导入相关模块 =========================================

# 导入时间模块
import time
# 导入PCF8574模块
from led_bar import LEDBar

# ======================================== 全局变量 ============================================

# ======================================== 功能函数 ============================================

# ======================================== 自定义类 ============================================

# ======================================== 初始化配置 ==========================================
# 上电延时3s
time.sleep(3)
# 打印调试消息
print("FreakStudio: Test PCF8574 Module")
# 动态创建一个只含 write() 的对象（不是自定义类）
pcf = type("Obj", (), {})()

# ========================================  主程序  ===========================================

def write(v):
    v &= 0xFF
    logical = (~v) & 0xFF  # LEDBar 默认低电平点亮
    print("phys=0x%02X  logical=0b%s" % (v, format(logical, "08b")))

pcf.write = write  # 挂载 write 方法

# 如果你的硬件并非低电平点亮，可取消下一行注释：
# LEDBar._ACTIVE_LOW = False

bar = LEDBar(pcf)
bar.display_level(3)          # 点亮前3个
bar.set_led(6, True)          # 点亮索引6
bar.set_all(0b10101010)       # 交替图样
bar.clear()                   # 全灭
