# Python env   : MicroPython v1.23.0 on Raspberry Pi Pico
# -*- coding: utf-8 -*-        
# @Time    : 2025/1/19 上午10:57   
# @Author  : 侯钧瀚           
# @File    : main.py       
# @Description : iic扫描测试程序

# ======================================== 导入相关模块 =========================================

from machine import Pin, I2C
# 导入时间相关模块
import time

# ======================================== 全局变量 ============================================

# ======================================== 功能函数 ============================================

# ======================================== 自定义类 ============================================

# ======================================== 初始化配置 ==========================================

# ========================================  主程序  ===========================================

# 上电延时3s
time.sleep(3)
# 打印调试消息
print("FreakStudio: I2C Expansion Test")
i2c = I2C(id=0, sda=Pin(4), scl=Pin(5), freq=400000)
while True:
    # 扫描并打印iic上地址
    print(i2c.scan())
    time.sleep(1)