# Python env   : MicroPython v1.23.0
# -*- coding: utf-8 -*-
# @Time    : 2023/01/01 00:00
# @Author  : Jose D. Montoya
# @File    : __init__.py
# @Description : micropython_bmm150 包初始化文件
# @License : MIT

__version__ = "1.0.0"
__author__ = "Jose D. Montoya"
__license__ = "MIT"
__platform__ = "MicroPython v1.23"

# ======================================== 导入相关模块 =========================================
from micropython_bmm150.bmm150 import BMM150
from micropython_bmm150.i2c_helpers import CBits, RegisterStruct

# ======================================== 全局变量 ============================================
__all__ = ["BMM150", "CBits", "RegisterStruct"]

# ======================================== 功能函数 ============================================

# ======================================== 自定义类 ============================================

# ======================================== 初始化配置 ==========================================

# ========================================  主程序  ===========================================
