# Python env   : MicroPython v1.23.0
# -*- coding: utf-8 -*-
# @Time    : 2025/9/1 上午11:22
# @Author  : ben0i0d
# @File    : main.py
# @Description : dht22驱动测试文件 测试输出温湿度
# @License : CC BY-NC 4.0

# ======================================== 导入相关模块 =========================================

import dht22
from machine import Pin
from utime import sleep

# ======================================== 全局变量 ============================================

# ======================================== 功能函数 ============================================

# ======================================== 自定义类 ============================================

# ======================================== 初始化配置 ===========================================

# ========================================  主程序  ============================================

if __name__ == '__main__':
    sleep(2)
    dht_pin = Pin(0)
    d = dht22.DHT(dht_pin)
    while True:
        print('Temperature: {}. Humidity: {}'.format(d.get_temperature(), d.get_humidity()))
        sleep(2)
