# Python env   : MicroPython v1.23.0
# -*- coding: utf-8 -*-
# @Time    : 2025/9/9 下午5:00
# @Author  : bhavi-thiran
# @File    : main.py
# @Description : I2C接口LCD1602显示屏驱动 实现显示控制、光标管理、字符输出等核心功能

# ======================================== 导入相关模块 =========================================

from LCD_I2C import *

# ======================================== 全局变量 ============================================


# ======================================== 功能函数 ============================================

# ======================================== 自定义类 ============================================

# ======================================== 初始化配置 ===========================================

lcd = LCD(sda=2, scl=3)

# ========================================  主程序  ===========================================

lcd.set_cursor(0, 0)
lcd.write("Hello World")
time.sleep(1)

lcd.off()
time.sleep(1)

lcd.on()
time.sleep(1)

lcd.on(cursor=False, blink=True)
time.sleep(1)

lcd.on(cursor=True, blink=False)
time.sleep(1)

lcd.on(cursor=True, blink=True)
time.sleep(1.5)

lcd.clear()
